<template lang="pug">
  article
    p
      strong Добро пожаловать в новую версию таймера.
    p Главные нововведения  &mdash; авторизация через социальные сети и навигация по группам задач как по папкам.
    .well
      p Важное следствие авторизации и переезда на новый сервер для преданных фанатов - необходимость импортировать старые данные.
    p ЧТО С ИМПОРТАМИ?
    .well
      p Если всё прошло плохо, в конце концов можно импортировать всё ручной копипастой через <q>экспорт</q> зайдя по старым ссылкам, а потом <q>импорт</q> в меню.
    p Возможность работать без авторизации сохранена. Как и старые версии таймера по старым ссылкам.
</template>
<script>
  import helpArrow from '@/components/help-arrow'
  export default {
    components: {
      helpArrow
    }
  }
</script>
<style lang="stylus">
  @import '~@/assets/stylesheets/article'
</style>
