<template lang="pug">
  article
    p
      strong Авторизация vs Локальное использование
    p Вы можете использовать таймер без авторизации. Данные при этом будут храниться локально в текущем броузере.
    .well
      p Это означает, что из другого браузера эти данные будут недоступны. А при очистке истории или переустановке данного браузера исчезнут совсем.
    p Более привычная иллюзия надёжности и конфиденциальности требует авторизации.
    .well
      p При этом ваши данные будут надёжно и конфиденциально храниться на серверах заснеженного Урала. И будут доступны даже из тибетской кофеварки, если у неё есть интернет.
    p В любом случае есть импорт/экспорт данных и можно бэкапиться врукопашную, если будет страшно.
    hr
    p Авторизация, бэкап, язык, валюта и другие увлекательные чекбоксы спрятаны в <help-arrow target="#toggle-sidebar-top">боковое меню</help-arrow>.
</template>
<script>
  import helpArrow from '@/components/help-arrow'
  export default {
    components: {
      helpArrow
    }
  }
</script>
<style lang="stylus">
  @import '~@/assets/stylesheets/article'
</style>
